In [10]:
import ibm_db

In [ ]:
# Database Connection Credentials

# Credentials Removed for Security and Privacy

In [ ]:
#Create Database Connection

In [ ]:
#Create database connection

dsn = (
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd)

try:
    conn = ibm_db.connect(dsn, "", "")
    print ("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)

except:
    print ("Unable to connect: ", ibm_db.conn_errormsg() )

In [ ]:
dropQuery = "drop table INSTRUCTOR"

# Now execute the drop statement 
dropStmt = ibm_db.exec_immediate(conn, dropQuery)

In [19]:
#Construct the Create Table DDL statement

createQuery = " create table INSTRUCTOR(id INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2))"

In [20]:
#Now fill in the name of the method and execute the statement 

createStmt = ibm_db.exec_immediate(conn, createQuery)

# Insert data into table

In [21]:
# Construct query - INSERT

insertQuery = " insert into INSTRUCTOR values(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')"

In [22]:
# Execute the insert statement 

insertStmt = ibm_db.exec_immediate(conn, insertQuery)

In [23]:
# Insert the remaining two rows of data

insertQuery2 = "insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')"

In [25]:
# Execeute Insert2

insertStmt2 = ibm_db.exec_immediate(conn, insertQuery2)

# Query Data in the table

In [26]:
# Retrieve all rows 

selectQuery = "select * from INSTRUCTOR"

In [27]:
# Execute

selectStmt = ibm_db.exec_immediate(conn, selectQuery)

In [28]:
#Fetch dictionary for the first row only

ibm_db.fetch_both(selectStmt)

{'ID': 1,
 0: 1,
 'FNAME': 'Rav',
 1: 'Rav',
 'LNAME': 'Ahuja',
 2: 'Ahuja',
 'CITY': 'TORONTO',
 3: 'TORONTO',
 'CCODE': 'CA',
 4: 'CA'}

In [29]:
#Fetch the rest of the rows and print the ID and FNAME for those rows

while ibm_db.fetch_row(selectStmt) != False:
    print("ID:", ibm_db.result(selectStmt, 0), "FNAME:", ibm_db.result(selectStmt, "FNAME"))

ID: 2 FNAME: Raul
ID: 3 FNAME: Hima

In [39]:
# Update Rav's city to MOOSETOWN 

updateQuery = "update INSTRUCTOR set CITY = 'MOOSETOWN' where FNAME = 'Rav'"

In [40]:
# Execute

updateStmt = ibm_db.exec_immediate(conn, updateQuery)

# Retrieve data into Pandas

In [43]:
import pandas 
import ibm_db_dbi

In [46]:
# Connection for pandas

pconn = ibm_db_dbi.Connection(conn)

In [47]:
# Query statement to retrieve all rows in INSTRUCTOR table

selectQuery = "select * from INSTRUCTOR"

In [48]:
# Retrieve query results into a pandas dataframe 

pdf = pandas.read_sql(selectQuery, pconn)

In [49]:
# Print just the LNAME for first row in the pandas data frame 
pdf.LNAME[0]

'Ahuja'

In [50]:
# Print the entire data frame 
pdf

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [51]:
# Check rows and columns

pdf.shape

(3, 5)

In [52]:
# Close connection

ibm_db.close(conn)

True